ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp151dxx_cm4.h
/***************  Bit definition for DDRCTRL_RFSHTMG register  ****************/
#define DDRCTRL_RFSHTMG_T_RFC_MIN_Pos        (0U)
#define DDRCTRL_RFSHTMG_T_RFC_MIN_Msk        (0x3FFU << DDRCTRL_RFSHTMG_T_RFC_MIN_Pos)        /*!< 0x000003FF */
#define DDRCTRL_RFSHTMG_T_RFC_MIN            DDRCTRL_RFSHTMG_T_RFC_MIN_Msk                    /*!< tRFC (min): Minimum time from refresh to refresh or activate. */
#define DDRCTRL_RFSHTMG_T_RFC_MIN_0          (0x1U << DDRCTRL_RFSHTMG_T_RFC_MIN_Pos)          /*!< 0x00000001 */
#define DDRCTRL_RFSHTMG_T_RFC_MIN_1          (0x2U << DDRCTRL_RFSHTMG_T_RFC_MIN_Pos)          /*!< 0x00000002 */
#define DDRCTRL_RFSHTMG_T_RFC_MIN_2          (0x4U << DDRCTRL_RFSHTMG_T_RFC_MIN_Pos)          /*!< 0x00000004 */
#define DDRCTRL_RFSHTMG_T_RFC_MIN_3          (0x8U << DDRCTRL_RFSHTMG_T_RFC_MIN_Pos)          /*!< 0x00000008 */
#define DDRCTRL_RFSHTMG_T_RFC_MIN_4          (0x10U << DDRCTRL_RFSHTMG_T_RFC_MIN_Pos)         /*!< 0x00000010 */
#define DDRCTRL_RFSHTMG_T_RFC_MIN_5          (0x20U << DDRCTRL_RFSHTMG_T_RFC_MIN_Pos)         /*!< 0x00000020 */
#define DDRCTRL_RFSHTMG_T_RFC_MIN_6          (0x40U << DDRCTRL_RFSHTMG_T_RFC_MIN_Pos)         /*!< 0x00000040 */
#define DDRCTRL_RFSHTMG_T_RFC_MIN_7          (0x80U << DDRCTRL_RFSHTMG_T_RFC_MIN_Pos)         /*!< 0x00000080 */
#define DDRCTRL_RFSHTMG_T_RFC_MIN_8          (0x100U << DDRCTRL_RFSHTMG_T_RFC_MIN_Pos)        /*!< 0x00000100 */
#define DDRCTRL_RFSHTMG_T_RFC_MIN_9          (0x200U << DDRCTRL_RFSHTMG_T_RFC_MIN_Pos)        /*!< 0x00000200 */
#define DDRCTRL_RFSHTMG_LPDDR3_TREFBW_EN_Pos (15U)
#define DDRCTRL_RFSHTMG_LPDDR3_TREFBW_EN_Msk (0x1U << DDRCTRL_RFSHTMG_LPDDR3_TREFBW_EN_Pos)   /*!< 0x00008000 */
#define DDRCTRL_RFSHTMG_LPDDR3_TREFBW_EN     DDRCTRL_RFSHTMG_LPDDR3_TREFBW_EN_Msk             /*!< Used only when LPDDR3 memory type is connected. Should only be changed when DDRCTRL is in reset. Specifies whether to use the tREFBW parameter (required by some LPDDR3 devices which comply with earlier versions of the LPDDR3 JEDEC specification) or not: */
#define DDRCTRL_RFSHTMG_T_RFC_NOM_X1_X32_Pos (16U)
#define DDRCTRL_RFSHTMG_T_RFC_NOM_X1_X32_Msk (0xFFFU << DDRCTRL_RFSHTMG_T_RFC_NOM_X1_X32_Pos) /*!< 0x0FFF0000 */
#define DDRCTRL_RFSHTMG_T_RFC_NOM_X1_X32     DDRCTRL_RFSHTMG_T_RFC_NOM_X1_X32_Msk             /*!< tREFI: Average time interval between refreshes per rank (Specification: 7.8us for DDR2, DDR3 and DDR4. See JEDEC specification for mDDR, LPDDR2, LPDDR3 and LPDDR4). */
#define DDRCTRL_RFSHTMG_T_RFC_NOM_X1_X32_0   (0x1U << DDRCTRL_RFSHTMG_T_RFC_NOM_X1_X32_Pos)   /*!< 0x00010000 */
#define DDRCTRL_RFSHTMG_T_RFC_NOM_X1_X32_1   (0x2U << DDRCTRL_RFSHTMG_T_RFC_NOM_X1_X32_Pos)   /*!< 0x00020000 */
#define DDRCTRL_RFSHTMG_T_RFC_NOM_X1_X32_2   (0x4U << DDRCTRL_RFSHTMG_T_RFC_NOM_X1_X32_Pos)   /*!< 0x00040000 */
#define DDRCTRL_RFSHTMG_T_RFC_NOM_X1_X32_3   (0x8U << DDRCTRL_RFSHTMG_T_RFC_NOM_X1_X32_Pos)   /*!< 0x00080000 */
#define DDRCTRL_RFSHTMG_T_RFC_NOM_X1_X32_4   (0x10U << DDRCTRL_RFSHTMG_T_RFC_NOM_X1_X32_Pos)  /*!< 0x00100000 */
#define DDRCTRL_RFSHTMG_T_RFC_NOM_X1_X32_5   (0x20U << DDRCTRL_RFSHTMG_T_RFC_NOM_X1_X32_Pos)  /*!< 0x00200000 */
#define DDRCTRL_RFSHTMG_T_RFC_NOM_X1_X32_6   (0x40U << DDRCTRL_RFSHTMG_T_RFC_NOM_X1_X32_Pos)  /*!< 0x00400000 */
#define DDRCTRL_RFSHTMG_T_RFC_NOM_X1_X32_7   (0x80U << DDRCTRL_RFSHTMG_T_RFC_NOM_X1_X32_Pos)  /*!< 0x00800000 */
#define DDRCTRL_RFSHTMG_T_RFC_NOM_X1_X32_8   (0x100U << DDRCTRL_RFSHTMG_T_RFC_NOM_X1_X32_Pos) /*!< 0x01000000 */
#define DDRCTRL_RFSHTMG_T_RFC_NOM_X1_X32_9   (0x200U << DDRCTRL_RFSHTMG_T_RFC_NOM_X1_X32_Pos) /*!< 0x02000000 */
#define DDRCTRL_RFSHTMG_T_RFC_NOM_X1_X32_10  (0x400U << DDRCTRL_RFSHTMG_T_RFC_NOM_X1_X32_Pos) /*!< 0x04000000 */
#define DDRCTRL_RFSHTMG_T_RFC_NOM_X1_X32_11  (0x800U << DDRCTRL_RFSHTMG_T_RFC_NOM_X1_X32_Pos) /*!< 0x08000000 */
#define DDRCTRL_RFSHTMG_T_RFC_NOM_X1_SEL_Pos (31U)
#define DDRCTRL_RFSHTMG_T_RFC_NOM_X1_SEL_Msk (0x1U << DDRCTRL_RFSHTMG_T_RFC_NOM_X1_SEL_Pos)  /*!< 0x80000000 */
#define DDRCTRL_RFSHTMG_T_RFC_NOM_X1_SEL     DDRCTRL_RFSHTMG_T_RFC_NOM_X1_SEL_Msk         /*!< Specifies whether the t_rfc_nom_x1_x32 register value is x1 or x32. */

/**************  Bit definition for DDRCTRL_CRCPARCTL0 register  **************/
#define DDRCTRL_CRCPARCTL0_DFI_ALERT_ERR_INT_EN_Pos  (0U)
#define DDRCTRL_CRCPARCTL0_DFI_ALERT_ERR_INT_EN_Msk  (0x1U << DDRCTRL_CRCPARCTL0_DFI_ALERT_ERR_INT_EN_Pos)  /*!< 0x00000001 */
#define DDRCTRL_CRCPARCTL0_DFI_ALERT_ERR_INT_EN      DDRCTRL_CRCPARCTL0_DFI_ALERT_ERR_INT_EN_Msk            /*!< Interrupt enable bit for DFI alert error. If this bit is set, any parity/CRC error detected on the dfi_alert_n input results in an interrupt being set on CRCPARSTAT.dfi_alert_err_int. */
#define DDRCTRL_CRCPARCTL0_DFI_ALERT_ERR_INT_CLR_Pos (1U)
#define DDRCTRL_CRCPARCTL0_DFI_ALERT_ERR_INT_CLR_Msk (0x1U << DDRCTRL_CRCPARCTL0_DFI_ALERT_ERR_INT_CLR_Pos) /*!< 0x00000002 */
#define DDRCTRL_CRCPARCTL0_DFI_ALERT_ERR_INT_CLR     DDRCTRL_CRCPARCTL0_DFI_ALERT_ERR_INT_CLR_Msk           /*!< Interrupt clear bit for DFI alert error. If this bit is set, the alert error interrupt on CRCPARSTAT.dfi_alert_err_int is cleared. When the clear operation is complete, the DDRCTRL automatically clears this bit. */
#define DDRCTRL_CRCPARCTL0_DFI_ALERT_ERR_CNT_CLR_Pos (2U)
#define DDRCTRL_CRCPARCTL0_DFI_ALERT_ERR_CNT_CLR_Msk (0x1U << DDRCTRL_CRCPARCTL0_DFI_ALERT_ERR_CNT_CLR_Pos) /*!< 0x00000004 */
#define DDRCTRL_CRCPARCTL0_DFI_ALERT_ERR_CNT_CLR     DDRCTRL_CRCPARCTL0_DFI_ALERT_ERR_CNT_CLR_Msk           /*!< DFI alert error count clear. Clear bit for DFI alert error counter. Asserting this bit, clears the DFI alert error counter, CRCPARSTAT.dfi_alert_err_cnt. When the clear operation is complete, the DDRCTRL automatically clears this bit. */

/**************  Bit definition for DDRCTRL_CRCPARSTAT register  **************/
#define DDRCTRL_CRCPARSTAT_DFI_ALERT_ERR_CNT_Pos (0U)
#define DDRCTRL_CRCPARSTAT_DFI_ALERT_ERR_CNT_Msk (0xFFFFU << DDRCTRL_CRCPARSTAT_DFI_ALERT_ERR_CNT_Pos) /*!< 0x0000FFFF */
#define DDRCTRL_CRCPARSTAT_DFI_ALERT_ERR_CNT     DDRCTRL_CRCPARSTAT_DFI_ALERT_ERR_CNT_Msk              /*!< DFI alert error count. */
#define DDRCTRL_CRCPARSTAT_DFI_ALERT_ERR_CNT_0   (0x1U << DDRCTRL_CRCPARSTAT_DFI_ALERT_ERR_CNT_Pos)    /*!< 0x00000001 */
#define DDRCTRL_CRCPARSTAT_DFI_ALERT_ERR_CNT_1   (0x2U << DDRCTRL_CRCPARSTAT_DFI_ALERT_ERR_CNT_Pos)    /*!< 0x00000002 */
#define DDRCTRL_CRCPARSTAT_DFI_ALERT_ERR_CNT_2   (0x4U << DDRCTRL_CRCPARSTAT_DFI_ALERT_ERR_CNT_Pos)    /*!< 0x00000004 */
#define DDRCTRL_CRCPARSTAT_DFI_ALERT_ERR_CNT_3   (0x8U << DDRCTRL_CRCPARSTAT_DFI_ALERT_ERR_CNT_Pos)    /*!< 0x00000008 */
#define DDRCTRL_CRCPARSTAT_DFI_ALERT_ERR_CNT_4   (0x10U << DDRCTRL_CRCPARSTAT_DFI_ALERT_ERR_CNT_Pos)   /*!< 0x00000010 */
#define DDRCTRL_CRCPARSTAT_DFI_ALERT_ERR_CNT_5   (0x20U << DDRCTRL_CRCPARSTAT_DFI_ALERT_ERR_CNT_Pos)   /*!< 0x00000020 */
#define DDRCTRL_CRCPARSTAT_DFI_ALERT_ERR_CNT_6   (0x40U << DDRCTRL_CRCPARSTAT_DFI_ALERT_ERR_CNT_Pos)   /*!< 0x00000040 */
#define DDRCTRL_CRCPARSTAT_DFI_ALERT_ERR_CNT_7   (0x80U << DDRCTRL_CRCPARSTAT_DFI_ALERT_ERR_CNT_Pos)   /*!< 0x00000080 */
#define DDRCTRL_CRCPARSTAT_DFI_ALERT_ERR_CNT_8   (0x100U << DDRCTRL_CRCPARSTAT_DFI_ALERT_ERR_CNT_Pos)  /*!< 0x00000100 */
#define DDRCTRL_CRCPARSTAT_DFI_ALERT_ERR_CNT_9   (0x200U << DDRCTRL_CRCPARSTAT_DFI_ALERT_ERR_CNT_Pos)  /*!< 0x00000200 */
#define DDRCTRL_CRCPARSTAT_DFI_ALERT_ERR_CNT_10  (0x400U << DDRCTRL_CRCPARSTAT_DFI_ALERT_ERR_CNT_Pos)  /*!< 0x00000400 */
#define DDRCTRL_CRCPARSTAT_DFI_ALERT_ERR_CNT_11  (0x800U << DDRCTRL_CRCPARSTAT_DFI_ALERT_ERR_CNT_Pos)  /*!< 0x00000800 */
#define DDRCTRL_CRCPARSTAT_DFI_ALERT_ERR_CNT_12  (0x1000U << DDRCTRL_CRCPARSTAT_DFI_ALERT_ERR_CNT_Pos) /*!< 0x00001000 */
#define DDRCTRL_CRCPARSTAT_DFI_ALERT_ERR_CNT_13  (0x2000U << DDRCTRL_CRCPARSTAT_DFI_ALERT_ERR_CNT_Pos) /*!< 0x00002000 */
#define DDRCTRL_CRCPARSTAT_DFI_ALERT_ERR_CNT_14  (0x4000U << DDRCTRL_CRCPARSTAT_DFI_ALERT_ERR_CNT_Pos) /*!< 0x00004000 */
#define DDRCTRL_CRCPARSTAT_DFI_ALERT_ERR_CNT_15  (0x8000U << DDRCTRL_CRCPARSTAT_DFI_ALERT_ERR_CNT_Pos) /*!< 0x00008000 */
#define DDRCTRL_CRCPARSTAT_DFI_ALERT_ERR_INT_Pos (16U)
#define DDRCTRL_CRCPARSTAT_DFI_ALERT_ERR_INT_Msk (0x1U << DDRCTRL_CRCPARSTAT_DFI_ALERT_ERR_INT_Pos)    /*!< 0x00010000 */
#define DDRCTRL_CRCPARSTAT_DFI_ALERT_ERR_INT     DDRCTRL_CRCPARSTAT_DFI_ALERT_ERR_INT_Msk              /*!< DFI alert error interrupt. */

