ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp151dxx_cm4.h
/*****************  Bit definition for RCC_HSICFGR register  ******************/
#define RCC_HSICFGR_HSIDIV_Pos                    (0U)
#define RCC_HSICFGR_HSIDIV_Msk                    (0x3U << RCC_HSICFGR_HSIDIV_Pos)                   /*!< 0x00000003 */
#define RCC_HSICFGR_HSIDIV                        RCC_HSICFGR_HSIDIV_Msk                             /*!< HSI clock divider */
#define RCC_HSICFGR_HSIDIV_0                      (0x1U << RCC_HSICFGR_HSIDIV_Pos)                   /*!< 0x00000001 */
#define RCC_HSICFGR_HSIDIV_1                      (0x2U << RCC_HSICFGR_HSIDIV_Pos)                   /*!< 0x00000002 */
#define RCC_HSICFGR_HSITRIM_Pos                   (8U)
#define RCC_HSICFGR_HSITRIM_Msk                   (0x7FU << RCC_HSICFGR_HSITRIM_Pos)                 /*!< 0x00007F00 */
#define RCC_HSICFGR_HSITRIM                       RCC_HSICFGR_HSITRIM_Msk                            /*!< HSI clock trimming */
#define RCC_HSICFGR_HSITRIM_0                     (0x1U << RCC_HSICFGR_HSITRIM_Pos)                /*!< 0x00000100 */
#define RCC_HSICFGR_HSITRIM_1                     (0x2U << RCC_HSICFGR_HSITRIM_Pos)                /*!< 0x00000200 */
#define RCC_HSICFGR_HSITRIM_2                     (0x4U << RCC_HSICFGR_HSITRIM_Pos)                /*!< 0x00000400 */
#define RCC_HSICFGR_HSITRIM_3                     (0x8U << RCC_HSICFGR_HSITRIM_Pos)                /*!< 0x00000800 */
#define RCC_HSICFGR_HSITRIM_4                     (0x10U << RCC_HSICFGR_HSITRIM_Pos)               /*!< 0x00001000 */
#define RCC_HSICFGR_HSITRIM_5                     (0x20U << RCC_HSICFGR_HSITRIM_Pos)               /*!< 0x00002000 */
#define RCC_HSICFGR_HSITRIM_6                     (0x40U << RCC_HSICFGR_HSITRIM_Pos)               /*!< 0x00004000 */
#define RCC_HSICFGR_HSICAL_Pos                    (16U)
#define RCC_HSICFGR_HSICAL_Msk                    (0xFFFU << RCC_HSICFGR_HSICAL_Pos)                 /*!< 0x0FFF0000 */
#define RCC_HSICFGR_HSICAL                        RCC_HSICFGR_HSICAL_Msk                             /*!< HSI clock calibration */
#define RCC_HSICFGR_HSICAL_0                      (0x1U << RCC_HSICFGR_HSICAL_Pos)               /*!< 0x00010000 */
#define RCC_HSICFGR_HSICAL_1                      (0x2U << RCC_HSICFGR_HSICAL_Pos)               /*!< 0x00020000 */
#define RCC_HSICFGR_HSICAL_2                      (0x4U << RCC_HSICFGR_HSICAL_Pos)               /*!< 0x00040000 */
#define RCC_HSICFGR_HSICAL_3                      (0x8U << RCC_HSICFGR_HSICAL_Pos)               /*!< 0x00080000 */
#define RCC_HSICFGR_HSICAL_4                      (0x10U << RCC_HSICFGR_HSICAL_Pos)              /*!< 0x00100000 */
#define RCC_HSICFGR_HSICAL_5                      (0x20U << RCC_HSICFGR_HSICAL_Pos)              /*!< 0x00200000 */
#define RCC_HSICFGR_HSICAL_6                      (0x40U << RCC_HSICFGR_HSICAL_Pos)              /*!< 0x00400000 */
#define RCC_HSICFGR_HSICAL_7                      (0x80U << RCC_HSICFGR_HSICAL_Pos)              /*!< 0x00800000 */
#define RCC_HSICFGR_HSICAL_8                      (0x100U << RCC_HSICFGR_HSICAL_Pos)             /*!< 0x01000000 */
#define RCC_HSICFGR_HSICAL_9                      (0x200U << RCC_HSICFGR_HSICAL_Pos)             /*!< 0x02000000 */
#define RCC_HSICFGR_HSICAL_10                     (0x400U << RCC_HSICFGR_HSICAL_Pos)             /*!< 0x04000000 */
#define RCC_HSICFGR_HSICAL_11                     (0x800U << RCC_HSICFGR_HSICAL_Pos)             /*!< 0x08000000 */

/*****************  Bit definition for RCC_CSICFGR register  ******************/
#define RCC_CSICFGR_CSITRIM_Pos                   (8U)
#define RCC_CSICFGR_CSITRIM_Msk                   (0x1FU << RCC_CSICFGR_CSITRIM_Pos)                 /*!< 0x00001F00 */
#define RCC_CSICFGR_CSITRIM                       RCC_CSICFGR_CSITRIM_Msk                            /*!< CSI clock trimming */
#define RCC_CSICFGR_CSITRIM_0                     (0x1U << RCC_CSICFGR_CSITRIM_Pos)                /*!< 0x00000100 */
#define RCC_CSICFGR_CSITRIM_1                     (0x2U << RCC_CSICFGR_CSITRIM_Pos)                /*!< 0x00000200 */
#define RCC_CSICFGR_CSITRIM_2                     (0x4U << RCC_CSICFGR_CSITRIM_Pos)                /*!< 0x00000400 */
#define RCC_CSICFGR_CSITRIM_3                     (0x8U << RCC_CSICFGR_CSITRIM_Pos)                /*!< 0x00000800 */
#define RCC_CSICFGR_CSITRIM_4                     (0x10U << RCC_CSICFGR_CSITRIM_Pos)               /*!< 0x00001000 */
#define RCC_CSICFGR_CSICAL_Pos                    (16U)
#define RCC_CSICFGR_CSICAL_Msk                    (0xFFU << RCC_CSICFGR_CSICAL_Pos)                  /*!< 0x00FF0000 */
#define RCC_CSICFGR_CSICAL                        RCC_CSICFGR_CSICAL_Msk                             /*!< CSI clock calibration */
#define RCC_CSICFGR_CSICAL_0                      (0x1U << RCC_CSICFGR_CSICAL_Pos)               /*!< 0x00010000 */
#define RCC_CSICFGR_CSICAL_1                      (0x2U << RCC_CSICFGR_CSICAL_Pos)               /*!< 0x00020000 */
#define RCC_CSICFGR_CSICAL_2                      (0x4U << RCC_CSICFGR_CSICAL_Pos)               /*!< 0x00040000 */
#define RCC_CSICFGR_CSICAL_3                      (0x8U << RCC_CSICFGR_CSICAL_Pos)               /*!< 0x00080000 */
#define RCC_CSICFGR_CSICAL_4                      (0x10U << RCC_CSICFGR_CSICAL_Pos)              /*!< 0x00100000 */
#define RCC_CSICFGR_CSICAL_5                      (0x20U << RCC_CSICFGR_CSICAL_Pos)              /*!< 0x00200000 */
#define RCC_CSICFGR_CSICAL_6                      (0x40U << RCC_CSICFGR_CSICAL_Pos)              /*!< 0x00400000 */
#define RCC_CSICFGR_CSICAL_7                      (0x80U << RCC_CSICFGR_CSICAL_Pos)              /*!< 0x00800000 */

/*****************  Bit definition for RCC_MPCKSELR register  *****************/
#define RCC_MPCKSELR_MPUSRC_Pos                   (0U)
#define RCC_MPCKSELR_MPUSRC_Msk                   (0x3U << RCC_MPCKSELR_MPUSRC_Pos)                  /*!< 0x00000003 */
#define RCC_MPCKSELR_MPUSRC                       RCC_MPCKSELR_MPUSRC_Msk                            /*!< MPU clock switch */
#define RCC_MPCKSELR_MPUSRC_0                     (0x1U << RCC_MPCKSELR_MPUSRC_Pos)                  /*!< 0x00000001 */
#define RCC_MPCKSELR_MPUSRC_1                     (0x2U << RCC_MPCKSELR_MPUSRC_Pos)                  /*!< 0x00000002 */
#define RCC_MPCKSELR_MPUSRCRDY_Pos                (31U)
#define RCC_MPCKSELR_MPUSRCRDY_Msk                (0x1U << RCC_MPCKSELR_MPUSRCRDY_Pos)               /*!< 0x80000000 */
#define RCC_MPCKSELR_MPUSRCRDY                    RCC_MPCKSELR_MPUSRCRDY_Msk                         /*!< MPU clock switch status */

/****************  Bit definition for RCC_ASSCKSELR register  *****************/
#define RCC_ASSCKSELR_AXISSRC_Pos                 (0U)
#define RCC_ASSCKSELR_AXISSRC_Msk                 (0x7U << RCC_ASSCKSELR_AXISSRC_Pos)                /*!< 0x00000007 */
#define RCC_ASSCKSELR_AXISSRC                     RCC_ASSCKSELR_AXISSRC_Msk                          /*!< AXI sub-system clock switch */
#define RCC_ASSCKSELR_AXISSRC_0                   (0x1U << RCC_ASSCKSELR_AXISSRC_Pos)                /*!< 0x00000001 */
#define RCC_ASSCKSELR_AXISSRC_1                   (0x2U << RCC_ASSCKSELR_AXISSRC_Pos)                /*!< 0x00000002 */
#define RCC_ASSCKSELR_AXISSRC_2                   (0x4U << RCC_ASSCKSELR_AXISSRC_Pos)                /*!< 0x00000004 */
#define RCC_ASSCKSELR_AXISSRCRDY_Pos              (31U)
#define RCC_ASSCKSELR_AXISSRCRDY_Msk              (0x1U << RCC_ASSCKSELR_AXISSRCRDY_Pos)             /*!< 0x80000000 */
#define RCC_ASSCKSELR_AXISSRCRDY                  RCC_ASSCKSELR_AXISSRCRDY_Msk                       /*!< AXI sub-system clock switch status */

