ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp151dxx_cm4.h
/**************  Bit definition for RCC_MP_AHB5ENSETR register  ***************/
#define RCC_MP_AHB5ENSETR_GPIOZEN_Pos             (0U)
#define RCC_MP_AHB5ENSETR_GPIOZEN_Msk             (0x1U << RCC_MP_AHB5ENSETR_GPIOZEN_Pos)            /*!< 0x00000001 */
#define RCC_MP_AHB5ENSETR_GPIOZEN                 RCC_MP_AHB5ENSETR_GPIOZEN_Msk                      /*!< GPIOZ Secure peripheral clocks enable */
#define RCC_MP_AHB5ENSETR_CRYP1EN_Pos             (4U)
#define RCC_MP_AHB5ENSETR_CRYP1EN_Msk             (0x1U << RCC_MP_AHB5ENSETR_CRYP1EN_Pos)            /*!< 0x00000010 */
#define RCC_MP_AHB5ENSETR_CRYP1EN                 RCC_MP_AHB5ENSETR_CRYP1EN_Msk                      /*!< CRYP1 (3DES/AES1) peripheral clocks enable */
#define RCC_MP_AHB5ENSETR_HASH1EN_Pos             (5U)
#define RCC_MP_AHB5ENSETR_HASH1EN_Msk             (0x1U << RCC_MP_AHB5ENSETR_HASH1EN_Pos)            /*!< 0x00000020 */
#define RCC_MP_AHB5ENSETR_HASH1EN                 RCC_MP_AHB5ENSETR_HASH1EN_Msk                      /*!< HASH1 peripheral clocks enable */
#define RCC_MP_AHB5ENSETR_RNG1EN_Pos              (6U)
#define RCC_MP_AHB5ENSETR_RNG1EN_Msk              (0x1U << RCC_MP_AHB5ENSETR_RNG1EN_Pos)             /*!< 0x00000040 */
#define RCC_MP_AHB5ENSETR_RNG1EN                  RCC_MP_AHB5ENSETR_RNG1EN_Msk                       /*!< RNG1 peripheral clocks enable */
#define RCC_MP_AHB5ENSETR_BKPSRAMEN_Pos           (8U)
#define RCC_MP_AHB5ENSETR_BKPSRAMEN_Msk           (0x1U << RCC_MP_AHB5ENSETR_BKPSRAMEN_Pos)          /*!< 0x00000100 */
#define RCC_MP_AHB5ENSETR_BKPSRAMEN               RCC_MP_AHB5ENSETR_BKPSRAMEN_Msk                    /*!< BKPSRAM clocks enable */
#define RCC_MP_AHB5ENSETR_AXIMCEN_Pos             (16U)
#define RCC_MP_AHB5ENSETR_AXIMCEN_Msk             (0x1U << RCC_MP_AHB5ENSETR_AXIMCEN_Pos)            /*!< 0x00010000 */
#define RCC_MP_AHB5ENSETR_AXIMCEN                 RCC_MP_AHB5ENSETR_AXIMCEN_Msk                      /*!< AXIMC clocks enable */

/**************  Bit definition for RCC_MP_AHB5ENCLRR register  ***************/
#define RCC_MP_AHB5ENCLRR_GPIOZEN_Pos             (0U)
#define RCC_MP_AHB5ENCLRR_GPIOZEN_Msk             (0x1U << RCC_MP_AHB5ENCLRR_GPIOZEN_Pos)            /*!< 0x00000001 */
#define RCC_MP_AHB5ENCLRR_GPIOZEN                 RCC_MP_AHB5ENCLRR_GPIOZEN_Msk                      /*!< GPIOZ Secure peripheral clocks enable */
#define RCC_MP_AHB5ENCLRR_CRYP1EN_Pos             (4U)
#define RCC_MP_AHB5ENCLRR_CRYP1EN_Msk             (0x1U << RCC_MP_AHB5ENCLRR_CRYP1EN_Pos)            /*!< 0x00000010 */
#define RCC_MP_AHB5ENCLRR_CRYP1EN                 RCC_MP_AHB5ENCLRR_CRYP1EN_Msk                      /*!< CRYP1 (3DES/AES1) peripheral clocks enable */
#define RCC_MP_AHB5ENCLRR_HASH1EN_Pos             (5U)
#define RCC_MP_AHB5ENCLRR_HASH1EN_Msk             (0x1U << RCC_MP_AHB5ENCLRR_HASH1EN_Pos)            /*!< 0x00000020 */
#define RCC_MP_AHB5ENCLRR_HASH1EN                 RCC_MP_AHB5ENCLRR_HASH1EN_Msk                      /*!< HASH1 peripheral clocks enable */
#define RCC_MP_AHB5ENCLRR_RNG1EN_Pos              (6U)
#define RCC_MP_AHB5ENCLRR_RNG1EN_Msk              (0x1U << RCC_MP_AHB5ENCLRR_RNG1EN_Pos)             /*!< 0x00000040 */
#define RCC_MP_AHB5ENCLRR_RNG1EN                  RCC_MP_AHB5ENCLRR_RNG1EN_Msk                       /*!< RNG1 peripheral clocks enable */
#define RCC_MP_AHB5ENCLRR_BKPSRAMEN_Pos           (8U)
#define RCC_MP_AHB5ENCLRR_BKPSRAMEN_Msk           (0x1U << RCC_MP_AHB5ENCLRR_BKPSRAMEN_Pos)          /*!< 0x00000100 */
#define RCC_MP_AHB5ENCLRR_BKPSRAMEN               RCC_MP_AHB5ENCLRR_BKPSRAMEN_Msk                    /*!< BKPSRAM clocks enable */
#define RCC_MP_AHB5ENCLRR_AXIMCEN_Pos             (16U)
#define RCC_MP_AHB5ENCLRR_AXIMCEN_Msk             (0x1U << RCC_MP_AHB5ENCLRR_AXIMCEN_Pos)            /*!< 0x00010000 */
#define RCC_MP_AHB5ENCLRR_AXIMCEN                 RCC_MP_AHB5ENCLRR_AXIMCEN_Msk                      /*!< AXIMC clocks enable */

/**************  Bit definition for RCC_MP_AHB6ENSETR register  ***************/
#define RCC_MP_AHB6ENSETR_MDMAEN_Pos              (0U)
#define RCC_MP_AHB6ENSETR_MDMAEN_Msk              (0x1U << RCC_MP_AHB6ENSETR_MDMAEN_Pos)             /*!< 0x00000001 */
#define RCC_MP_AHB6ENSETR_MDMAEN                  RCC_MP_AHB6ENSETR_MDMAEN_Msk                       /*!< MDMA peripheral clocks enable */
#define RCC_MP_AHB6ENSETR_GPUEN_Pos               (5U)
#define RCC_MP_AHB6ENSETR_GPUEN_Msk               (0x1U << RCC_MP_AHB6ENSETR_GPUEN_Pos)              /*!< 0x00000020 */
#define RCC_MP_AHB6ENSETR_GPUEN                   RCC_MP_AHB6ENSETR_GPUEN_Msk                        /*!< GPU peripheral clocks enable */
#define RCC_MP_AHB6ENSETR_ETHCKEN_Pos             (7U)
#define RCC_MP_AHB6ENSETR_ETHCKEN_Msk             (0x1U << RCC_MP_AHB6ENSETR_ETHCKEN_Pos)            /*!< 0x00000080 */
#define RCC_MP_AHB6ENSETR_ETHCKEN                 RCC_MP_AHB6ENSETR_ETHCKEN_Msk                      /*!< Enable of the Ethernet clock generated by the RCC (eth_ker_ck) */
#define RCC_MP_AHB6ENSETR_ETHTXEN_Pos             (8U)
#define RCC_MP_AHB6ENSETR_ETHTXEN_Msk             (0x1U << RCC_MP_AHB6ENSETR_ETHTXEN_Pos)            /*!< 0x00000100 */
#define RCC_MP_AHB6ENSETR_ETHTXEN                 RCC_MP_AHB6ENSETR_ETHTXEN_Msk                      /*!< Ethernet Transmission Clock Enable */
#define RCC_MP_AHB6ENSETR_ETHRXEN_Pos             (9U)
#define RCC_MP_AHB6ENSETR_ETHRXEN_Msk             (0x1U << RCC_MP_AHB6ENSETR_ETHRXEN_Pos)            /*!< 0x00000200 */
#define RCC_MP_AHB6ENSETR_ETHRXEN                 RCC_MP_AHB6ENSETR_ETHRXEN_Msk                      /*!< Ethernet Reception Clock Enable */
#define RCC_MP_AHB6ENSETR_ETHMACEN_Pos            (10U)
#define RCC_MP_AHB6ENSETR_ETHMACEN_Msk            (0x1U << RCC_MP_AHB6ENSETR_ETHMACEN_Pos)           /*!< 0x00000400 */
#define RCC_MP_AHB6ENSETR_ETHMACEN                RCC_MP_AHB6ENSETR_ETHMACEN_Msk                     /*!< Ethernet MAC bus interface Clock Enable (hclk6 and aclk) */
#define RCC_MP_AHB6ENSETR_FMCEN_Pos               (12U)
#define RCC_MP_AHB6ENSETR_FMCEN_Msk               (0x1U << RCC_MP_AHB6ENSETR_FMCEN_Pos)              /*!< 0x00001000 */
#define RCC_MP_AHB6ENSETR_FMCEN                   RCC_MP_AHB6ENSETR_FMCEN_Msk                        /*!< FMC peripheral clocks enable */
#define RCC_MP_AHB6ENSETR_QSPIEN_Pos              (14U)
#define RCC_MP_AHB6ENSETR_QSPIEN_Msk              (0x1U << RCC_MP_AHB6ENSETR_QSPIEN_Pos)             /*!< 0x00004000 */
#define RCC_MP_AHB6ENSETR_QSPIEN                  RCC_MP_AHB6ENSETR_QSPIEN_Msk                       /*!< QUADSPI peripheral clocks enable */
#define RCC_MP_AHB6ENSETR_SDMMC1EN_Pos            (16U)
#define RCC_MP_AHB6ENSETR_SDMMC1EN_Msk            (0x1U << RCC_MP_AHB6ENSETR_SDMMC1EN_Pos)           /*!< 0x00010000 */
#define RCC_MP_AHB6ENSETR_SDMMC1EN                RCC_MP_AHB6ENSETR_SDMMC1EN_Msk                     /*!< SDMMC1 and SDMMC1 delay (DLYBSD1) block peripheral clocks enable */
#define RCC_MP_AHB6ENSETR_SDMMC2EN_Pos            (17U)
#define RCC_MP_AHB6ENSETR_SDMMC2EN_Msk            (0x1U << RCC_MP_AHB6ENSETR_SDMMC2EN_Pos)           /*!< 0x00020000 */
#define RCC_MP_AHB6ENSETR_SDMMC2EN                RCC_MP_AHB6ENSETR_SDMMC2EN_Msk                     /*!< SDMMC2 and SDMMC2 delay (DLYBSD2) block peripheral clocks enable */
#define RCC_MP_AHB6ENSETR_CRC1EN_Pos              (20U)
#define RCC_MP_AHB6ENSETR_CRC1EN_Msk              (0x1U << RCC_MP_AHB6ENSETR_CRC1EN_Pos)             /*!< 0x00100000 */
#define RCC_MP_AHB6ENSETR_CRC1EN                  RCC_MP_AHB6ENSETR_CRC1EN_Msk                       /*!< CRC1 peripheral clocks enable */
#define RCC_MP_AHB6ENSETR_USBHEN_Pos              (24U)
#define RCC_MP_AHB6ENSETR_USBHEN_Msk              (0x1U << RCC_MP_AHB6ENSETR_USBHEN_Pos)             /*!< 0x01000000 */
#define RCC_MP_AHB6ENSETR_USBHEN                  RCC_MP_AHB6ENSETR_USBHEN_Msk                       /*!< USBH peripheral clocks enable */

/**************  Bit definition for RCC_MP_AHB6ENCLRR register  ***************/
#define RCC_MP_AHB6ENCLRR_MDMAEN_Pos              (0U)
#define RCC_MP_AHB6ENCLRR_MDMAEN_Msk              (0x1U << RCC_MP_AHB6ENCLRR_MDMAEN_Pos)             /*!< 0x00000001 */
#define RCC_MP_AHB6ENCLRR_MDMAEN                  RCC_MP_AHB6ENCLRR_MDMAEN_Msk                       /*!< MDMA peripheral clocks enable */
#define RCC_MP_AHB6ENCLRR_GPUEN_Pos               (5U)
#define RCC_MP_AHB6ENCLRR_GPUEN_Msk               (0x1U << RCC_MP_AHB6ENCLRR_GPUEN_Pos)              /*!< 0x00000020 */
#define RCC_MP_AHB6ENCLRR_GPUEN                   RCC_MP_AHB6ENCLRR_GPUEN_Msk                        /*!< GPU peripheral clocks enable */
#define RCC_MP_AHB6ENCLRR_ETHCKEN_Pos             (7U)
#define RCC_MP_AHB6ENCLRR_ETHCKEN_Msk             (0x1U << RCC_MP_AHB6ENCLRR_ETHCKEN_Pos)            /*!< 0x00000080 */
#define RCC_MP_AHB6ENCLRR_ETHCKEN                 RCC_MP_AHB6ENCLRR_ETHCKEN_Msk                      /*!< Disable of the Ethernet clock generated by the RCC (eth_ker_ck) */
#define RCC_MP_AHB6ENCLRR_ETHTXEN_Pos             (8U)
#define RCC_MP_AHB6ENCLRR_ETHTXEN_Msk             (0x1U << RCC_MP_AHB6ENCLRR_ETHTXEN_Pos)            /*!< 0x00000100 */
#define RCC_MP_AHB6ENCLRR_ETHTXEN                 RCC_MP_AHB6ENCLRR_ETHTXEN_Msk                      /*!< Disable of the Ethernet Transmission Clock */
#define RCC_MP_AHB6ENCLRR_ETHRXEN_Pos             (9U)
#define RCC_MP_AHB6ENCLRR_ETHRXEN_Msk             (0x1U << RCC_MP_AHB6ENCLRR_ETHRXEN_Pos)            /*!< 0x00000200 */
#define RCC_MP_AHB6ENCLRR_ETHRXEN                 RCC_MP_AHB6ENCLRR_ETHRXEN_Msk                      /*!< Disable of the Ethernet Reception Clock */
#define RCC_MP_AHB6ENCLRR_ETHMACEN_Pos            (10U)
#define RCC_MP_AHB6ENCLRR_ETHMACEN_Msk            (0x1U << RCC_MP_AHB6ENCLRR_ETHMACEN_Pos)           /*!< 0x00000400 */
#define RCC_MP_AHB6ENCLRR_ETHMACEN                RCC_MP_AHB6ENCLRR_ETHMACEN_Msk                     /*!< Disable of the bus interface clock for ETH block (hclk6 and aclk) */
#define RCC_MP_AHB6ENCLRR_FMCEN_Pos               (12U)
#define RCC_MP_AHB6ENCLRR_FMCEN_Msk               (0x1U << RCC_MP_AHB6ENCLRR_FMCEN_Pos)              /*!< 0x00001000 */
#define RCC_MP_AHB6ENCLRR_FMCEN                   RCC_MP_AHB6ENCLRR_FMCEN_Msk                        /*!< FMC peripheral clocks enable */
#define RCC_MP_AHB6ENCLRR_QSPIEN_Pos              (14U)
#define RCC_MP_AHB6ENCLRR_QSPIEN_Msk              (0x1U << RCC_MP_AHB6ENCLRR_QSPIEN_Pos)             /*!< 0x00004000 */
#define RCC_MP_AHB6ENCLRR_QSPIEN                  RCC_MP_AHB6ENCLRR_QSPIEN_Msk                       /*!< QUADSPI and QUADSPI delay block peripheral clocks enable */
#define RCC_MP_AHB6ENCLRR_SDMMC1EN_Pos            (16U)
#define RCC_MP_AHB6ENCLRR_SDMMC1EN_Msk            (0x1U << RCC_MP_AHB6ENCLRR_SDMMC1EN_Pos)           /*!< 0x00010000 */
#define RCC_MP_AHB6ENCLRR_SDMMC1EN                RCC_MP_AHB6ENCLRR_SDMMC1EN_Msk                     /*!< SDMMC1 and SDMMC1 delay (DLYBSD1) block peripheral clocks enable */
#define RCC_MP_AHB6ENCLRR_SDMMC2EN_Pos            (17U)
#define RCC_MP_AHB6ENCLRR_SDMMC2EN_Msk            (0x1U << RCC_MP_AHB6ENCLRR_SDMMC2EN_Pos)           /*!< 0x00020000 */
#define RCC_MP_AHB6ENCLRR_SDMMC2EN                RCC_MP_AHB6ENCLRR_SDMMC2EN_Msk                     /*!< SDMMC2 and SDMMC2 delay (DLYBSD2) block peripheral clocks enable */
#define RCC_MP_AHB6ENCLRR_CRC1EN_Pos              (20U)
#define RCC_MP_AHB6ENCLRR_CRC1EN_Msk              (0x1U << RCC_MP_AHB6ENCLRR_CRC1EN_Pos)             /*!< 0x00100000 */
#define RCC_MP_AHB6ENCLRR_CRC1EN                  RCC_MP_AHB6ENCLRR_CRC1EN_Msk                       /*!< CRC1 peripheral clocks enable */
#define RCC_MP_AHB6ENCLRR_USBHEN_Pos              (24U)
#define RCC_MP_AHB6ENCLRR_USBHEN_Msk              (0x1U << RCC_MP_AHB6ENCLRR_USBHEN_Pos)             /*!< 0x01000000 */
#define RCC_MP_AHB6ENCLRR_USBHEN                  RCC_MP_AHB6ENCLRR_USBHEN_Msk                       /*!< USBH peripheral clocks enable */

